src/QuanLyDiaChiComApp/test/TestTaoKhuVuc/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:quan="QuanLyDiaChiComApp">
  <soapenv:Body>
    <quan:TaoKhuVucOperation>
      <mota>khong uu tien</mota>
      <tenkhuvuc>khu vuc k</tenkhuvuc>
    </quan:TaoKhuVucOperation>
  </soapenv:Body>
</soapenv:Envelope>